# 1) представлення дати
# 2) формування гіпотез і похідне
# 3) очистка даних
# 4) статистика
# 5) візуалізація
# 6) преза

library(tidyverse)

#-------------------------------------------------------------------------------

#Hypotheses:
# H₀ (нульова гіпотеза):        Тривалість прослуховування музики не впливає на
#                               рівень тривожності, депресії та безсоння.

# H₁ (альтернативна гіпотеза):  Тривалість прослуховування музики має вплив на
#                               рівень тривожності, депресії та безсоння.

setwd(dirname(rstudioapi::getActiveDocumentContext()$path))
df_music <- read_csv("mxmh_survey_results.csv")
df_music

df_music %>% colnames()
df_music %>% summary()
